import { IPersonalstatement } from '../component/Personalstatement/IPersonalstatement';

const Personalstatement: IPersonalstatement.Payload = {
  disable: false,

  contents: [
    '성장 과정 및 목표',
    '[게임과 함께 성장하다]',
    '어릴 때부터 게임에 관심이 많았던 한 아이는 점차 게임을 하는 것보다 만드는 것에 더 큰 흥미를 느끼게 되었습니다. 고등학생 시절, VisualStudio와 알만툴을 다뤄보며 적성에 맞음을 확인한 후 컴퓨터 공학을 전공하게 되었습니다.',
    '전공 과정에서 어려움도 많았지만, 이를 극복하며 성장할 수 있었습니다. 프로그래밍 이론이 이해되지 않을 때는 그룹 스터디와 멘토링을 통해 학습을 진행하였습니다. 서로 학습 내용을 발표하고 질의응답을 통해 부족한 부분을 채워 나갔습니다. 게임 개발에 대한 열정으로 전공 공부에 더욱 집중할 수 있었습니다.',
    '게임 개발에 대한 실전 경험도 꾸준히 쌓아왔습니다. 여러 게임잼과 대외활동에 참여하며 협업 능력을 키우고, 다양한 성향의 사람들과 소통하며 빠르게 기능을 구현하는 경험을 했습니다. 최근 한 게임잼에서 ‘다시 하고 싶은 게임’ 부문에서 수상하며 노력의 결실을 맺었습니다.',
    '이제 그 아이는 한 기업의 프로그래머로서 게임을 개발하고자 합니다. 한 기업 내에서 중요한 일원이 되어 이름을 알리는 것이 목표입니다. 또한, 인사이트를 공유하고 발표하며 타인에게 귀감이 되는 개발자가 되기 위해 끊임없이 노력하고 있습니다.',
    '',
    '타인과의 협업 과정에서 겪은 갈등과 이를 해결하기 위한 노력',
    '[존중과 배움]',
    '프로그래머 3명이 함께 프로젝트를 진행할 때, 저는 두 팀원의 개발 성향 차이로 인해 갈등을 겪었던 경험이 있습니다. 한 팀원은 기획이 완벽하게 정리될 때까지 개발을 시작하지 않는 성향이었고, 다른 팀원은 기획의 뼈대를 잡고 개발을 진행하면서 기획을 수정하는 성향이었습니다. 이로 인해 프로젝트 진행이 더뎌졌고, 답답함을 느꼈습니다.',
    '이 문제를 해결하기 위해 저는 두 팀원의 입장을 이해하고 존중하는 것부터 시작했습니다. 그들이 모두 프로젝트의 성공을 목표로 하고 있음을 존중하고, 의견을 조율하는 중재자 역할을 자처했습니다. 프로젝트를 스프린트 형식으로 나누어 개발을 진행하면서, 기획과 개발이 병행될 수 있도록 하였습니다. 그 결과, 프로젝트는 원래 계획보다 더욱 성공적으로 마무리될 수 있었습니다.',
    '프로젝트가 끝난 후, 저는 두 가지 개발 성향의 장단점을 돌아보았습니다. 기획이 완전히 정리된 후 개발을 시작하는 방식은 초기 개발 속도는 느리지만, 수정 사항이 적어 결과적으로 빠른 진행이 가능했습니다. 또한, 개발을 진행하면서 기획을 수정하는 방식은 유연한 기획 변경이 가능하며, 그 과정에서 더 나은 결과를 도출할 수 있었습니다.',
    '경험을 통해 저는 갈등 해결 능력을 깨달았으며, 서로 다른 성향의 팀원들과 효과적으로 협업할 수 있는 방법을 배웠습니다. 또한, 이 경험을 바탕으로 "존중과 배움"이라는 키워드와 함께 여러 갈등 상황을 해결할 때 활용합니다. 이 ‘존중과 배움’은 훗날 네이버에서 주최한 SEF2023의 발표 내용으로 선정되어 컨퍼런스 발표를 진행하였습니다.',
    '',
    '개발자 "이지민"의 장단점',
    '[커뮤니케이션]',
    '현업 경험과 다양한 대외활동을 통해 뛰어난 팀 커뮤니케이션 능력을 갖추고 있습니다. 특히, 팀원과의 대화를 통해 정확한 요구 사항을 파악하고, 그에 맞는 사용자 친화적인 코드를 작성하는 데 자신이 있습니다. 예를 들어, 기획자의 편의를 위해 엑셀 데이터를 기반으로 데이터를 입력하는 코드를 작성한 경험이 있습니다. 이로 인해 에디터에서 작업하던 기획자는 매우 만족했으며, 프로젝트의 진행 속도에도 유의미한 개선이 있었습니다.',
    '[끈기와 도전]',
    '도전에 두려움 없이 임하며, 끈기를 가지고 지속적으로 노력합니다. 프로그램의 자잘한 버그를 해결하기 위해 며칠간 집중적으로 문제를 분석하고 결국 버그를 수정한 경험이 있습니다. 프로그래머로서 가장 중요한 것은 요구 사항에 맞는 기능을 포기하지 않고 구현하는 것과, 그 과정에서 유지보수가 용이한 코드를 작성하는 것입니다. 이를 위해서는 도전 정신과 끈기가 필수적이라고 생각합니다.',
    '[이타주의]',
    '과거에는 지나치게 이타적인 성향을 가지고 있었습니다. 상대를 배려하는 것은 중요하지만, 과도한 부담을 스스로 짊어지는 것은 오히려 팀에 해가 될 수 있다는 것을 깨달았습니다. 여러 팀 프로젝트를 통해, 상대방을 배려하면서도 제가 감당할 수 없는 부분은 명확히 이야기하고, 합의점을 찾는 법을 배우게 되었습니다. 이를 통해 문제를 더 원활하게 해결할 수 있었으며, 이 접근이 더 좋은 방법이라는 것을 깨달았습니다.',
    '모든 사람은 제각각의 장단점을 가지고 있지만, 단점을 해결하지 않고 받아들이기보단 단점을 장점으로 바꾸거나 해결하기 위해 끝없이 노력해야 발전하는 사람임 될 수 있다고 생각합니다.',
  ],
};

export default Personalstatement;
